# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

text = input('Enter string:')
subText = input('Enter what ward you want to count:')
print(text.count(subText))